/*
Р—Р°РґР°С‡Р° 4. РџРµСЂРµРІРµСЂРЅСѓС‚СЊ С‡РёСЃР»Рѕ
Р’РІРµСЃС‚Рё С†РµР»РѕРµ С‡РёСЃР»Рѕ Рё В«РїРµСЂРµРІРµСЂРЅСѓС‚СЊВ» РµРіРѕ, С‚Р°Рє С‡С‚РѕР±С‹ РїРµСЂРІР°СЏ С†РёС„СЂР° СЃС‚Р°Р»Р°
РїРѕСЃР»РµРґРЅРµР№ Рё С‚.Рґ.
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: Р¦РµР»РѕРµ РЅРµРѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: Р¦РµР»РѕРµ РЅРµРѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ РЅР°РѕР±РѕСЂРѕС‚
РџСЂРёРјРµСЂ в„–1
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 1234
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: 4321
РџСЂРёРјРµСЂ в„–2
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 782
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: 287
*/

#include <stdio.h>

int main(int argc, char const *argv[])
{

  return 0;
}