/*
Р—Р°РґР°С‡Р° 3. Р’СЃРµ С†РёС„СЂС‹ С‡РµС‚РЅС‹Рµ
Р’РІРµСЃС‚Рё С†РµР»РѕРµ С‡РёСЃР»Рѕ Рё РѕРїСЂРµРґРµР»РёС‚СЊ, РІРµСЂРЅРѕ Р»Рё, С‡С‚Рѕ РІСЃРµ РµРіРѕ С†РёС„СЂС‹ С‡РµС‚РЅС‹Рµ
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: РћРґРЅРѕ С†РµР»РѕРµ С‡РёСЃР»Рѕ
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: YES РёР»Рё NO
РџСЂРёРјРµСЂ в„–1
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 2684
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: YES
РџСЂРёРјРµСЂ в„–2
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 2994
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: NO
*/

#include <stdio.h>

int main(int argc, char const *argv[])
{

  return 0;
}