/*
Р—Р°РґР°С‡Р° 5. Р’СЃРµ СЃС‡Р°СЃС‚Р»РёРІС‹Рµ С‡РёСЃР»Р°
Р’РІРµСЃС‚Рё РЅР°С‚СѓСЂР°Р»СЊРЅРѕРµ С‡РёСЃР»Рѕ Рё РЅР°РїРµС‡Р°С‚Р°С‚СЊ РІСЃРµ С‡РёСЃР»Р° РѕС‚ 10 РґРѕ РІРІРµРґРµРЅРЅРѕРіРѕ С‡РёСЃР»Р° -
Сѓ РєРѕС‚РѕСЂС‹С… СЃСѓРјРјР° С†РёС„СЂ СЂР°РІРЅР° РїСЂРѕРёР·РІРµРґРµРЅРёСЋ С†РёС„СЂ
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: РћРґРЅРѕ РЅР°С‚СѓСЂР°Р»СЊРЅРѕРµ С‡РёСЃР»Рѕ Р±РѕР»СЊС€РµРµ 10
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: Р§РёСЃР»Р° Сѓ РєРѕС‚РѕСЂС‹С… СЃСѓРјРјР° С†РёС„СЂ СЂР°РІРЅР° РїСЂРѕРёР·РІРµРґРµРЅРёСЋ
С†РёС„СЂ С‡РµСЂРµР· РїСЂРѕР±РµР» РІ РїРѕСЂСЏРґРєРµ РІРѕР·СЂР°СЃС‚Р°РЅРёСЏ. РќРµ РїСЂРµРІРѕСЃС…РѕРґСЏС‰РёРµ РІРІРµРґРµРЅРЅРѕРµ
С‡РёСЃР»Рѕ.
РџСЂРёРјРµСЂ в„–1
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 200
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: 22 123 132
РџСЂРёРјРµСЂ в„–2
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 1000
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: 22 123 132 213 231 312 321
РџСЂРёРјРµСЂ в„–3
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 22
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: 22
*/

#include <stdio.h>

int main(int argc, char const *argv[])
{

  return 0;
}