/*
Р—Р°РґР°С‡Р° 2. Р РѕРІРЅРѕ С‚СЂРё С†РёС„СЂС‹
Р’РІРµСЃС‚Рё С†РµР»РѕРµ С‡РёСЃР»Рѕ Рё РѕРїСЂРµРґРµР»РёС‚СЊ, РІРµСЂРЅРѕ Р»Рё, С‡С‚Рѕ РІ РЅС‘Рј СЂРѕРІРЅРѕ 3 С†РёС„СЂС‹.
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: Р¦РµР»РѕРµ РїРѕР»РѕР¶РёС‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: РћРґРЅРѕ СЃР»РѕРІРѕ: YES РёР»Рё NO
РџСЂРёРјРµСЂ в„–1
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 123
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: YES
РџСЂРёРјРµСЂ в„–2
Р”Р°РЅРЅС‹Рµ РЅР° РІС…РѕРґРµ: 1234
Р”Р°РЅРЅС‹Рµ РЅР° РІС‹С…РѕРґРµ: NO
*/

#include <stdio.h>

int main(int argc, char const *argv[])
{

  return 0;
}